isPolygonOutOfRect2d(System.UInt32!System.Runtime.CompilerServices.IsLong,OdGePoint2d!System.Runtime.CompilerServices.IsConst*,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determines whether the polygon is out of the specified rectangle.
\param numPt   [in]  Count of polygon points.
\param pPoints [in]  Pointer to an array of polygon points.
\param minPt   [in]  Minimum extents point.
\param maxPt   [in]  Maximum extents point.
\returns
true if polygon is out of the rectangle or if polygon contains a rectangle.
This method returns false if the polygon is inside the specified rectangle or if they intersect.
\remarks
Corresponding C++ library: TD_Ge